## Plan Result (prod_app_registrations)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c4fb60b5-f376-4e17-9751-0e35850235de"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["DTS Orphaned Resource Cleanup"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "8a180e28-12b1-4f56-9d60-b0e4f4d8778e"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS Orphaned Resource Cleanup"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "c4fb60b5-f376-4e17-9751-0e35850235de"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->